In [1]:
import sys

In [2]:
sys.version_info

sys.version_info(major=3, minor=7, micro=3, releaselevel='final', serial=0)

In [3]:
if sys.platform == 'darwin' :
    print(" Mac OS")
else :
    print(" Windows ")

 Windows

## 시본 데이터 가져오기

In [4]:
import pandas as pd

In [5]:
import seaborn as sns

In [6]:
tips = sns.load_dataset("tips")

In [7]:
tips.head()

   total_bill   tip     sex smoker  day    time  size
0       16.99  1.01  Female     No  Sun  Dinner     2
1       10.34  1.66    Male     No  Sun  Dinner     3
2       21.01  3.50    Male     No  Sun  Dinner     3
3       23.68  3.31    Male     No  Sun  Dinner     2
4       24.59  3.61  Female     No  Sun  Dinner     4

In [8]:
tips.tail()

     total_bill   tip     sex smoker   day    time  size
239       29.03  5.92    Male     No   Sat  Dinner     3
240       27.18  2.00  Female    Yes   Sat  Dinner     2
241       22.67  2.00    Male    Yes   Sat  Dinner     2
242       17.82  1.75    Male     No   Sat  Dinner     2
243       18.78  3.00  Female     No  Thur  Dinner     2

In [9]:
tips.ndim

2

In [10]:
tips.shape

(244, 7)

# 1. 쿼리 처리 알아보기

### 주식 데이터 검색 모듈 가져오기

In [11]:
import FinanceDataReader as fdr
fdr.__version__

'0.7.2'

### 한국증권거래소 상장기업 정보 가져오기

In [12]:
df_krx = fdr.StockListing('KRX')

## 1.1 문자열로 실행해서 내부 결과를 가져오기

### Name 열을 검색해서 정보 가져오기

In [13]:
item_name = "신라젠"

### query 메소드는 문자열로 전달

    값에 대한 것은 문자열 내에 문자열로 처리해야 함

In [14]:
df_krx.query("Name=='{}'".format(item_name))

     Symbol Name           Sector           Industry
752  215600  신라젠  자연과학 및 공학 연구개발업  펙사벡(바이러스 항암면역치료제)

### eval 메소드는 논리식의 결과만을 처리

In [15]:
df_krx.eval("Name=='{}'".format(item_name)).head()

0    False
1    False
2    False
3    False
4    False
dtype: bool

### 검색해온 데이터 프레임에서 팬시검색처리

In [16]:
df_krx.query("Name=='{}'".format(item_name))[['Symbol','Name']]

     Symbol Name
752  215600  신라젠

## 1-2 F 포매팅 이용하기

### 코스닥 기업 정보 검색하기

In [17]:
df_kosdaq = fdr.StockListing('KOSDAQ')

In [18]:
item_name = "셀트리온헬스케어"

### f 포맷으로 문자열 처리

     문자열 앞에 f를 사용하면 새로운 문자열 포매팅 방식입니다. 중괄호 안에 변수 명을 사용하면 외부의 변수를 직접 참조합니다.

In [19]:
df_kosdaq.query(f"Name=='{item_name}'")

      Symbol      Name     Sector         Industry
1059  091990  셀트리온헬스케어  기타 전문 도매업  바이오의약품 마케팅 및 판매

In [20]:
df_kosdaq.query(f"Name=='{item_name}'")[['Symbol','Name']]

      Symbol      Name
1059  091990  셀트리온헬스케어

## 1-3  논리식을 이용한 쿼리

In [21]:
tips.head()

   total_bill   tip     sex smoker  day    time  size
0       16.99  1.01  Female     No  Sun  Dinner     2
1       10.34  1.66    Male     No  Sun  Dinner     3
2       21.01  3.50    Male     No  Sun  Dinner     3
3       23.68  3.31    Male     No  Sun  Dinner     2
4       24.59  3.61  Female     No  Sun  Dinner     4

### 문자열로 논리식을 만들어서 쿼리를 하면 내부의 정보를 가져온다

In [22]:
bill_30 = tips.query(f"total_bill > 30. ")

In [23]:
bill_30.head()

    total_bill   tip     sex smoker  day    time  size
11       35.26  5.00  Female     No  Sun  Dinner     4
23       39.42  7.58    Male     No  Sat  Dinner     4
39       31.27  5.00    Male     No  Sat  Dinner     3
44       30.40  5.60    Male     No  Sun  Dinner     4
47       32.40  6.00    Male     No  Sun  Dinner     4

## 2. 데이터 일부를 추출하기

## 2-1 임의의 샘플링하기

In [24]:
tips.sample(10)

     total_bill   tip     sex smoker   day    time  size
11        35.26  5.00  Female     No   Sun  Dinner     4
86        13.03  2.00    Male     No  Thur   Lunch     2
107       25.21  4.29    Male    Yes   Sat  Dinner     2
4         24.59  3.61  Female     No   Sun  Dinner     4
154       19.77  2.00    Male     No   Sun  Dinner     4
79        17.29  2.71    Male     No  Thur   Lunch     2
173       31.85  3.18    Male    Yes   Sun  Dinner     2
168       10.59  1.61  Female    Yes   Sat  Dinner     2
108       18.24  3.76    Male     No   Sat  Dinner     2
202       13.00  2.00  Female    Yes  Thur   Lunch     2

### 동일한 샘플링을 처리하기

In [25]:
tips.sample(n=3, random_state=1)

     total_bill   tip     sex smoker   day    time  size
67         3.07  1.00  Female    Yes   Sat  Dinner     1
243       18.78  3.00  Female     No  Thur  Dinner     2
206       26.59  3.41    Male    Yes   Sat  Dinner     3

In [26]:
tips.sample(n=3, random_state=1)

     total_bill   tip     sex smoker   day    time  size
67         3.07  1.00  Female    Yes   Sat  Dinner     1
243       18.78  3.00  Female     No  Thur  Dinner     2
206       26.59  3.41    Male    Yes   Sat  Dinner     3

## 2-2  필터링해서 정보를 가져오기

### 특정 열이름으로 가져오기

In [27]:
tips.filter(items=['tip', 'size']).head()

    tip  size
0  1.01     2
1  1.66     3
2  3.50     3
3  3.31     2
4  3.61     4

### 특정 문자열로 가져오기

In [28]:
tips.filter(like='t').head()

   total_bill   tip    time
0       16.99  1.01  Dinner
1       10.34  1.66  Dinner
2       21.01  3.50  Dinner
3       23.68  3.31  Dinner
4       24.59  3.61  Dinner

### 필터링으로 행의 정보 가져오기

In [29]:
import FinanceDataReader as fdr
fdr.__version__

'0.7.2'

In [30]:
df_krx = fdr.StockListing('KRX')

In [31]:
df_krx.head()

,Symbol,Name,Sector,Industry
0,001250,GS글로벌,상품 종합 도매업,"수출입업(시멘트,철강금속,전기전자,섬유,기계화학),상품중개,광업,채석업/하수처리 서..."
1,082740,HSD엔진,일반 목적용 기계 제조업,"대형선박용엔진,내연발전엔진"
2,001390,KG케미칼,기초 화학물질 제조업,"콘크리트혼화제, 비료, 친환경농자재, 수처리제"
3,011070,LG이노텍,전자부품 제조업,기타 전자부품 제조업
4,010060,OCI,기초 화학물질 제조업,"타르제품,카본블랙,무수프탈산,농약원제,석탄화학제품,정밀화학제품,플라스틱창호재 제조,판매"

### 필터링을 처리하기 위해 행의 인덱스 정보도 문자열 값으로 지정한다

In [32]:
df_krs_ = df_krx.set_index('Name')

In [33]:
df_krs_.head()

,Symbol,Sector,Industry
Name,,,
GS글로벌,001250,상품 종합 도매업,"수출입업(시멘트,철강금속,전기전자,섬유,기계화학),상품중개,광업,채석업/하수처리 서..."
HSD엔진,082740,일반 목적용 기계 제조업,"대형선박용엔진,내연발전엔진"
KG케미칼,001390,기초 화학물질 제조업,"콘크리트혼화제, 비료, 친환경농자재, 수처리제"
LG이노텍,011070,전자부품 제조업,기타 전자부품 제조업
OCI,010060,기초 화학물질 제조업,"타르제품,카본블랙,무수프탈산,농약원제,석탄화학제품,정밀화학제품,플라스틱창호재 제조,판매"

### 특정 이름을 지정해서 검색하면 행의 정보도 가져온다

In [34]:
df_krs_.filter(like='셀트리온', axis=0).head()

          Symbol                 Sector         Industry
Name
셀트리온      068270  기초 의약물질 및 생물학적 제제 제조업   램시마, 트룩시마, 허쥬마
셀트리온제약    068760                의약품 제조업     무선인터넷서비스및플랫폼
셀트리온헬스케어  091990              기타 전문 도매업  바이오의약품 마케팅 및 판매